; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p23-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (at t0 l0-1)
    (at t1 l1-2)
    (at t2 l2-1)
    (at p0 l2-1)
    (at p1 l1-0)
    (at p2 l1-2)
    (at p3 l2-2)
    (at p4 l0-1)
    (at p5 l2-1)
    (at p6 l0-1)
    (at p7 l1-0)
    (at p8 l2-2)
    (at p9 l2-0)
    (at p10 l0-0)
    (at p11 l1-0)
    (at p12 l1-0)
    (at p13 l1-0)
    (at p14 l2-1)
    (at p15 l2-1)
    (at p16 l0-1)
    (at p17 l1-2)
    (at p18 l0-1)
    (at p19 l2-0)
    (at p20 l2-2)
    (at p21 l2-1)
    (at p22 l1-0)
    (at a0 l1-0)
)
(:goal
    (and
        (at p0 l1-0)
        (at p1 l2-0)
        (at p2 l1-1)
        (at p3 l1-0)
        (at p4 l2-2)
        (at p5 l0-1)
        (at p6 l1-0)
        (at p7 l0-0)
        (at p8 l2-0)
        (at p9 l2-1)
        (at p10 l0-2)
        (at p11 l0-0)
        (at p12 l1-0)
        (at p13 l0-1)
        (at p14 l1-1)
        (at p15 l2-0)
        (at p16 l2-2)
        (at p17 l1-1)
        (at p18 l1-0)
        (at p19 l2-1)
        (at p20 l0-0)
        (at p21 l0-2)
        (at p22 l0-1)
    )
)
)

; plan
1. (load-truck p5 t2 l2-1)
   deleted: (at p5 l2-1)
   added: (in p5 t2)
   goals met: 1 of 23
2. (load-truck p21 t2 l2-1)
   deleted: (at p21 l2-1)
   added: (in p21 t2)
   goals met: 1 of 23
3. (load-truck p15 t2 l2-1)
   deleted: (at p15 l2-1)
   added: (in p15 t2)
   goals met: 1 of 23
4. (load-truck p14 t2 l2-1)
   deleted: (at p14 l2-1)
   added: (in p14 t2)
   goals met: 1 of 23
5. (load-truck p0 t2 l2-1)
   deleted: (at p0 l2-1)
   added: (in p0 t2)
   goals met: 1 of 23
6. (load-truck p2 t1 l1-2)
   deleted: (at p2 l1-2)
   added: (in p2 t1)
   goals met: 1 of 23
7. (load-truck p17 t1 l1-2)
   deleted: (at p17 l1-2)
   added: (in p17 t1)
   goals met: 1 of 23
8. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 1 of 23
9. (load-truck p6 t0 l0-1)
   deleted: (at p6 l0-1)
   added: (in p6 t0)
   goals met: 1 of 23
10. (load-truck p4 t0 l0-1)
   deleted: (at p4 l0-1)
   added: (in p4 t0)
   goals met: 1 of 23
11. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 23
12. (unload-truck p6 t0 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 1 of 23
13. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 1 of 23
14. (load-truck p10 t0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 t0)
   goals met: 1 of 23
15. (load-airplane p7 a0 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 a0)
   goals met: 1 of 23
16. (load-airplane p22 a0 l1-0)
   deleted: (at p22 l1-0)
   added: (in p22 a0)
   goals met: 1 of 23
17. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 1 of 23
18. (load-airplane p11 a0 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a0)
   goals met: 1 of 23
19. (load-airplane p1 a0 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 1 of 23
20. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 1 of 23
21. (load-truck p9 t2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 t2)
   goals met: 1 of 23
22. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 1 of 23
23. (unload-truck p21 t2 l2-0)
   deleted: (in p21 t2)
   added: (at p21 l2-0)
   goals met: 1 of 23
24. (load-truck p19 t2 l2-0)
   deleted: (at p19 l2-0)
   added: (in p19 t2)
   goals met: 1 of 23
25. (unload-truck p15 t2 l2-0)
   deleted: (in p15 t2)
   added: (at p15 l2-0)
   goals met: 2 of 23
26. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 2 of 23
27. (unload-truck p9 t2 l2-1)
   deleted: (in p9 t2)
   added: (at p9 l2-1)
   goals met: 3 of 23
28. (unload-truck p19 t2 l2-1)
   deleted: (in p19 t2)
   added: (at p19 l2-1)
   goals met: 4 of 23
29. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 4 of 23
30. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 4 of 23
31. (load-truck p8 t2 l2-2)
   deleted: (at p8 l2-2)
   added: (in p8 t2)
   goals met: 4 of 23
32. (load-truck p3 t2 l2-2)
   deleted: (at p3 l2-2)
   added: (in p3 t2)
   goals met: 4 of 23
33. (load-truck p20 t2 l2-2)
   deleted: (at p20 l2-2)
   added: (in p20 t2)
   goals met: 4 of 23
34. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 4 of 23
35. (unload-truck p8 t2 l2-0)
   deleted: (in p8 t2)
   added: (at p8 l2-0)
   goals met: 5 of 23
36. (unload-truck p3 t2 l2-0)
   deleted: (in p3 t2)
   added: (at p3 l2-0)
   goals met: 5 of 23
37. (unload-truck p20 t2 l2-0)
   deleted: (in p20 t2)
   added: (at p20 l2-0)
   goals met: 5 of 23
38. (unload-truck p14 t2 l2-0)
   deleted: (in p14 t2)
   added: (at p14 l2-0)
   goals met: 5 of 23
39. (unload-truck p0 t2 l2-0)
   deleted: (in p0 t2)
   added: (at p0 l2-0)
   goals met: 5 of 23
40. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 5 of 23
41. (unload-truck p2 t1 l1-1)
   deleted: (in p2 t1)
   added: (at p2 l1-1)
   goals met: 6 of 23
42. (unload-truck p17 t1 l1-1)
   deleted: (in p17 t1)
   added: (at p17 l1-1)
   goals met: 7 of 23
43. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 7 of 23
44. (load-truck p18 t0 l0-1)
   deleted: (at p18 l0-1)
   added: (in p18 t0)
   goals met: 7 of 23
45. (load-truck p16 t0 l0-1)
   deleted: (at p16 l0-1)
   added: (in p16 t0)
   goals met: 7 of 23
46. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 7 of 23
47. (unload-truck p18 t0 l0-0)
   deleted: (in p18 t0)
   added: (at p18 l0-0)
   goals met: 7 of 23
48. (unload-truck p16 t0 l0-0)
   deleted: (in p16 t0)
   added: (at p16 l0-0)
   goals met: 7 of 23
49. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 7 of 23
50. (unload-truck p10 t0 l0-2)
   deleted: (in p10 t0)
   added: (at p10 l0-2)
   goals met: 8 of 23
51. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 8 of 23
52. (unload-airplane p7 a0 l0-0)
   deleted: (in p7 a0)
   added: (at p7 l0-0)
   goals met: 9 of 23
53. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 9 of 23
54. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 9 of 23
55. (unload-airplane p22 a0 l0-0)
   deleted: (in p22 a0)
   added: (at p22 l0-0)
   goals met: 9 of 23
56. (load-airplane p18 a0 l0-0)
   deleted: (at p18 l0-0)
   added: (in p18 a0)
   goals met: 9 of 23
57. (load-airplane p16 a0 l0-0)
   deleted: (at p16 l0-0)
   added: (in p16 a0)
   goals met: 9 of 23
58. (unload-airplane p13 a0 l0-0)
   deleted: (in p13 a0)
   added: (at p13 l0-0)
   goals met: 9 of 23
59. (unload-airplane p11 a0 l0-0)
   deleted: (in p11 a0)
   added: (at p11 l0-0)
   goals met: 10 of 23
60. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 10 of 23
61. (load-airplane p5 a0 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 10 of 23
62. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 10 of 23
63. (load-truck p4 t2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 t2)
   goals met: 10 of 23
64. (load-airplane p3 a0 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a0)
   goals met: 10 of 23
65. (load-airplane p21 a0 l2-0)
   deleted: (at p21 l2-0)
   added: (in p21 a0)
   goals met: 10 of 23
66. (load-airplane p20 a0 l2-0)
   deleted: (at p20 l2-0)
   added: (in p20 a0)
   goals met: 10 of 23
67. (unload-airplane p16 a0 l2-0)
   deleted: (in p16 a0)
   added: (at p16 l2-0)
   goals met: 10 of 23
68. (load-truck p16 t2 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 t2)
   goals met: 10 of 23
69. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 10 of 23
70. (unload-truck p4 t2 l2-2)
   deleted: (in p4 t2)
   added: (at p4 l2-2)
   goals met: 11 of 23
71. (unload-truck p16 t2 l2-2)
   deleted: (in p16 t2)
   added: (at p16 l2-2)
   goals met: 12 of 23
72. (load-airplane p14 a0 l2-0)
   deleted: (at p14 l2-0)
   added: (in p14 a0)
   goals met: 12 of 23
73. (unload-airplane p1 a0 l2-0)
   deleted: (in p1 a0)
   added: (at p1 l2-0)
   goals met: 13 of 23
74. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 13 of 23
75. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 13 of 23
76. (unload-airplane p5 a0 l0-0)
   deleted: (in p5 a0)
   added: (at p5 l0-0)
   goals met: 13 of 23
77. (unload-airplane p21 a0 l0-0)
   deleted: (in p21 a0)
   added: (at p21 l0-0)
   goals met: 13 of 23
78. (unload-airplane p20 a0 l0-0)
   deleted: (in p20 a0)
   added: (at p20 l0-0)
   goals met: 14 of 23
79. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 14 of 23
80. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 15 of 23
81. (unload-airplane p3 a0 l1-0)
   deleted: (in p3 a0)
   added: (at p3 l1-0)
   goals met: 16 of 23
82. (unload-airplane p18 a0 l1-0)
   deleted: (in p18 a0)
   added: (at p18 l1-0)
   goals met: 17 of 23
83. (unload-airplane p14 a0 l1-0)
   deleted: (in p14 a0)
   added: (at p14 l1-0)
   goals met: 17 of 23
84. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 18 of 23
85. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 18 of 23
86. (load-truck p14 t1 l1-0)
   deleted: (at p14 l1-0)
   added: (in p14 t1)
   goals met: 18 of 23
87. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 18 of 23
88. (unload-truck p14 t1 l1-1)
   deleted: (in p14 t1)
   added: (at p14 l1-1)
   goals met: 19 of 23
89. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 19 of 23
90. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 19 of 23
91. (load-truck p22 t0 l0-0)
   deleted: (at p22 l0-0)
   added: (in p22 t0)
   goals met: 19 of 23
92. (load-truck p21 t0 l0-0)
   deleted: (at p21 l0-0)
   added: (in p21 t0)
   goals met: 19 of 23
93. (load-truck p13 t0 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 t0)
   goals met: 19 of 23
94. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 19 of 23
95. (unload-truck p5 t0 l0-1)
   deleted: (in p5 t0)
   added: (at p5 l0-1)
   goals met: 20 of 23
96. (unload-truck p22 t0 l0-1)
   deleted: (in p22 t0)
   added: (at p22 l0-1)
   goals met: 21 of 23
97. (unload-truck p13 t0 l0-1)
   deleted: (in p13 t0)
   added: (at p13 l0-1)
   goals met: 22 of 23
98. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 22 of 23
99. (unload-truck p21 t0 l0-2)
   deleted: (in p21 t0)
   added: (at p21 l0-2)
   goals met: 23 of 23
